cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
/*
   Copyright (c) 2024. CRIDP https://github.com/cridp

   Licensed under the Apache License, Version 2.0 (the "License");
   you may not use this file except in compliance with the License.
   You may obtain a copy of the License at

           http://www.apache.org/licenses/LICENSE-2.0

   Unless required by applicable law or agreed to in writing, software
   distributed under the License is distributed on an "AS IS" BASIS,
   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
   See the License for the specific language governing permissions and
   limitations under the License.
 */

#include <esp32-hal-gpio.h>
#include <map>
#include "esp_log.h"

#include <iohcRadio.h>
#include <log_buffer.h>
#include <utility>
#include "iohcCozyDevice2W.h"

// Timestamps pour mesures précises
volatile uint32_t timestamp_preamble_detected = 0;
volatile uint32_t timestamp_sync_detected = 0;
volatile uint32_t timestamp_payload_ready = 0;


// trame typique FSK : preamble (variable) + sync (3 B) + header (2 B) + payload (32 B) + CRC (2 B).
// airtime (s) = ( (preamble_bytes + 3 + 2 + payload_bytes + 2) * 8 ) / bitrate
#define LONG_PREAMBLE_MS 128  // 0x80 52-206 ms
#define SHORT_PREAMBLE_MS 16 // 11.458 ms
// Timeouts adaptatifs basés sur le débit
// airtime (s) = ( (preamble_bytes + 3SYNC + 2HEAD + payload_bytes + 2CRC) * 8 ) / bitrate
const uint32_t bitrate = 38400; // 38.4 kbps
const uint32_t maxPacketBits = (SHORT_PREAMBLE_MS + 3 + 2 + MAX_FRAME_LEN + 2) * 8;
const uint32_t minAirTimeMs = (maxPacketBits * 1000) / bitrate; // ~ms

TaskHandle_t IOHC::iohcRadio::txTaskHandle = nullptr;

// Structure pour gérer un paquet en transmission
struct TxPacketWrapper {
    IOHC::iohcPacket *packet;
    uint8_t repeatsRemaining;
    uint32_t repeatTime;

    explicit TxPacketWrapper(IOHC::iohcPacket *pkt)
        : packet(pkt),
          repeatsRemaining(pkt ? pkt->repeat : 0),
          repeatTime(pkt ? pkt->repeatTime : 0)
          {}

    ~TxPacketWrapper() {
        if (packet) {
            delete packet;
            packet = nullptr;
        }
    }
};

namespace IOHC {
    iohcRadio *iohcRadio::_iohcRadio = nullptr;
    // volatile bool iohcRadio::_g_preamble = false;
    // volatile bool iohcRadio::_g_payload = false;
    volatile uint32_t iohcRadio::_g_payload_millis = 0L;
    uint8_t iohcRadio::_flags[2] = {0, 0};
    volatile bool iohcRadio::f_lock_hop = false;
    volatile bool iohcRadio::send_lock = false;
    volatile bool iohcRadio::txMode = false;
    volatile iohcRadio::RadioState iohcRadio::radioState = iohcRadio::RadioState::IDLE;

    static IOHC::iohcPacket last1wPacket;

    void FHSSTimer(iohcRadio *iohc_radio) {
        // Check timeout
        iohc_radio->checkFHSSTimeout();

        // Si toujours verrouillé, pas de hop
        if (iohc_radio->f_lock_hop) {
            return;
        }

        // Ne sauter que si on est vraiment en RX idle
        if (iohcRadio::radioState != iohcRadio::RadioState::RX) {
            return;
        }

        // Incrémenter l'index de fréquence
        iohc_radio->currentFreqIdx++;
        if (iohc_radio->currentFreqIdx >= iohc_radio->num_freqs) {
            iohc_radio->currentFreqIdx = 0;
        }

        // Changer la fréquence seulement si on est en RX
        Radio::setCarrier(Radio::Carrier::Frequency, iohc_radio->scan_freqs[iohc_radio->currentFreqIdx]);

        // ESP_LOGV("IOHC", "FHSS hop to freq[%d]: %d Hz",
        //  iohc_radio->currentFreqIdx,
        //  iohc_radio->scan_freqs[iohc_radio->currentFreqIdx]);
    }

    /**
    * Verrouille le FHSS avec une raison spécifique
    */
    void iohcRadio::lockFHSS(const FHSSLockReason reason) {
        if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(5)) == pdTRUE) {
            // Garder la raison la plus "forte"
            if (reason > fhssLockReason) {
                fhssLockReason = reason;
                f_lock_hop = true;
                // fhss.fhss_lock = true;
                lastActivityTime = esp_timer_get_time();
                // ets_printf("(D) FHSS locked: %s\n", fhssLockReasonToString(reason));
            }
            xSemaphoreGive(fhss_state_mutex);
        }
    }

    /**
     * Déverrouille le FHSS pour une raison spécifique
     */
    void iohcRadio::unlockFHSS(const FHSSLockReason reason) {
        if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(5)) == pdTRUE) {
            // Déverrouiller seulement si c'est la même raison
            if (fhssLockReason == reason) {
                fhssLockReason = FHSSLockReason::NONE;
                f_lock_hop = false;
                // fhss.fhss_lock = false;
                // ets_printf("(D) FHSS unlocked: %s\n", fhssLockReasonToString(reason));
            }
            xSemaphoreGive(fhss_state_mutex);
        }
    }

    /**
    * Force le déverrouillage (pour reset manuel)
    */
    void iohcRadio::forceUnlockFHSS() {
        if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(5)) == pdTRUE) {
            fhssLockReason = FHSSLockReason::NONE;
            f_lock_hop = false;
            // fhss.fhss_lock = false;
            expectingResponse = false;

            // ESP_LOGW("IOHC", "FHSS force unlocked");
            xSemaphoreGive(fhss_state_mutex);
        }
    }
    void iohcRadio::setFHSSState(FHSSState newState) {
        if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(5)) == pdTRUE) {
            FHSSState oldState = fhssState;
            fhssState = newState;

            // Actions spécifiques selon le nouvel état
            switch (newState) {
                case FHSSState::SCANNING:
                    f_lock_hop = false; // Autoriser le hopping
                    // fhss.fhss_lock = false;
                    break;
                case FHSSState::PREAMBLE_DETECTED:
                case FHSSState::RECEIVING:
                case FHSSState::PROCESSING:
                case FHSSState::TRANSMITTING:
                    f_lock_hop = true; // Bloquer le hopping
                    break;
            }

            xSemaphoreGive(fhss_state_mutex);

            // Log des transitions d'état importantes
            if (oldState != newState) {
//                ets_printf("FHSS State transition: %s -> %s\n", fhssStateToString(oldState), fhssStateToString(newState));
            }

