cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
        }
    }
    iohcRadio::FHSSState iohcRadio::getFHSSState() {
        FHSSState state = FHSSState::SCANNING;
        if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(5)) == pdTRUE) {
            state = fhssState;
            xSemaphoreGive(fhss_state_mutex);
        }
        return state;
    }

    const char* iohcRadio::fhssStateToString(FHSSState state) {
        switch (state) {
            case FHSSState::SCANNING: return "SCANNING";
            case FHSSState::PREAMBLE_DETECTED: return "PREAMBLE_DETECTED";
            case FHSSState::RECEIVING: return "RECEIVING";
            case FHSSState::PROCESSING: return "PROCESSING";
            case FHSSState::TRANSMITTING: return "TRANSMITTING";
            default: return "UNKNOWN";
        }
    }
    uint64_t iohcRadio::getAdaptiveTimeout(FHSSLockReason reason) {
        switch (reason) {
            case FHSSLockReason::PREAMBLE_DETECTED:
                return 8750; // 42 bytes
            case FHSSLockReason::RECEIVING:
                return 10413;  // 50 bytes
            case FHSSLockReason::WAITING_RESPONSE:
                return responseTimeoutMs * 1000;
            default:
                return 100000; // 100ms par défaut
        }
    }
    void iohcRadio::handleFHSSTimeout() {
        FHSSLockReason oldReason = fhssLockReason;
        fhssLockReason = FHSSLockReason::NONE;
        f_lock_hop = false;
        expectingResponse = false;

        // Remettre en RX
        if (radioState != RadioState::TX) {
            Radio::setRx();
            setRadioState(RadioState::RX);
            unlockFHSS(oldReason);
            adaptiveFHSS->update();
        }

        ets_printf("FHSS Unlocked due to timeout (was: %s)\n", fhssLockReasonToString(oldReason));
    }/**
     * FHSS Watchdog
     */
    void iohcRadio::checkFHSSTimeout() {
        if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(5)) == pdTRUE) {
            if (f_lock_hop && fhssLockReason != FHSSLockReason::TRANSMITTING) {
                uint64_t elapsed = esp_timer_get_time() - lastActivityTime;
                uint64_t timeout = getAdaptiveTimeout(fhssLockReason);

                if (elapsed >= timeout) {
                        ets_printf("(D) FHSS timeout(%lld), forcing unlock (reason: %s, elapsed: %lldµs)\n", timeout, fhssLockReasonToString(fhssLockReason), elapsed);
                    handleFHSSTimeout();
                }
            }
            xSemaphoreGive(fhss_state_mutex);
        }
    }
    /**
     * Mettre à jour l'horodatage d'activité
     * Pas besoin de mutex pour juste mettre à jour un uint32_t
     */
    inline void IRAM_ATTR iohcRadio::updateFHSSActivity() {
        lastActivityTime = esp_timer_get_time();
    }
    /**
    * Indique qu'on attend une réponse après un envoi
    */
    void iohcRadio::setExpectingResponse(bool expecting, uint32_t timeoutMs = 1000) {
        if (xSemaphoreTake(fhss_state_mutex, pdMS_TO_TICKS(5)) == pdTRUE) {
            expectingResponse = expecting;
            responseTimeoutMs = timeoutMs;
            if (expecting) {
                lockFHSS(FHSSLockReason::WAITING_RESPONSE);
            }
            xSemaphoreGive(fhss_state_mutex);
        }
    }

    TaskHandle_t handle_interrupt;
    struct RadioIrqEvent {
        uint8_t source;  // 0 = DIO0 (payload), 1 = DIO2 (preamble)
        uint8_t edge;    // 0 = falling, 1 = rising
        uint32_t timestamp_us;
    };

    static QueueHandle_t radioIrqQueue = nullptr;
    static constexpr size_t RADIO_IRQ_QUEUE_LEN = 128;

    void optimizeRadioSensitivity(iohcRadio* radio, bool reduceFalsePositives) {
        if (reduceFalsePositives) {
            // Réduire la sensibilité pour moins de faux positifs
            Radio::writeByte(REG_RSSITHRESH, 0xFF); // Seuil RSSI plus élevé
            Radio::writeByte(REG_RXTIMEOUT2, 0x00); // Timeout plus court

            ets_printf("RADIO Optimized for reduced false positives\n");
        } else {
            // Augmenter la sensibilité pour plus de portée
            // Radio::writeByte(REG_RSSITHRESH, 0xE0); // Seuil RSSI plus bas
            // Radio::writeByte(REG_RXTIMEOUT2, 0x80); // Timeout plus long

            ets_printf("RADIO Optimized for maximum sensitivity\n");
        }
    }

    /**
    * No semaphore / lockFHSS() / updateFHSSActivity() here.
    * esp_timer_get_time() is ISR-safe ; millis() never sure.
    */
    void IRAM_ATTR handle_interrupt_fromDIO0(/*void* arg*/) {
        // static uint32_t lastIsrTime = 0;
        uint32_t now = esp_timer_get_time();
        // Debounce hardware + software
        // if (now - lastIsrTime < 50) return; // 50µs debounce
        // lastIsrTime = now;

        // Only GPIOS (opérations très courtes), pas d'appels bloquants
        RadioIrqEvent ev;
        ev.source = 0; // DIO0
        ev.edge = digitalRead(RADIO_PACKET_AVAIL) ? 1 : 0;
        ev.timestamp_us = now;

        // Send it to queue (FromISR)
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        xQueueSendFromISR(radioIrqQueue, &ev, &xHigherPriorityTaskWoken);
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    /**
    * No semaphore / lockFHSS() / updateFHSSActivity() here.
    * esp_timer_get_time() is ISR-safe ; millis() never sure.
    */
    void IRAM_ATTR handle_interrupt_fromDIO2(/*void* arg*/) {

        // static uint32_t lastIsrTime = 0;
        uint32_t now = esp_timer_get_time();
        // if (now - lastIsrTime < 50) return;
        // lastIsrTime = now;

        RadioIrqEvent ev;
        ev.source = 1; // DIO2
        ev.edge = digitalRead(RADIO_PREAMBLE_DETECTED) ? 1 : 0;
        ev.timestamp_us = now;

        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        xQueueSendFromISR(radioIrqQueue, &ev, &xHigherPriorityTaskWoken);
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }

    void handlePreambleDetected(iohcRadio* radio, uint32_t timestamp) {
        timestamp_preamble_detected = timestamp;

        radio->lockFHSS(iohcRadio::FHSSLockReason::PREAMBLE_DETECTED);
        radio->updateFHSSActivity();
        radio->setRadioState(iohcRadio::RadioState::PREAMBLE);
        radio->setFHSSState(iohcRadio::FHSSState::PREAMBLE_DETECTED);

        // Logger pour debug
        // ets_printf("IRQ Preamble detected @ %luµs\n", timestamp);
    }
    void handlePayloadReady(iohcRadio* radio, uint32_t timestamp) {
        timestamp_payload_ready = timestamp;
        if (iohcRadio::radioState == iohcRadio::RadioState::PREAMBLE || iohcRadio::radioState == iohcRadio::RadioState::RX) {
            radio->lockFHSS(iohcRadio::FHSSLockReason::RECEIVING);
            radio->updateFHSSActivity();
            radio->setRadioState(iohcRadio::RadioState::PAYLOAD);
            radio->tickerCounter(radio);
            }
    }

