cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
    void handlePreambleLost(iohcRadio* radio, uint32_t timestamp) {
        // Seulement si on était en train de recevoir un préambule
        if (radio->getFHSSState() == iohcRadio::FHSSState::PREAMBLE_DETECTED) {
            // C'est probablement une fausse détection ou un signal trop faible
            radio->unlockFHSS(iohcRadio::FHSSLockReason::PREAMBLE_DETECTED);
            radio->setFHSSState(iohcRadio::FHSSState::SCANNING);
            radio->setRadioState(iohcRadio::RadioState::RX);

            // Remettre la radio en état normal
            Radio::setRx();
        }
    }
    void handlePacketSent(iohcRadio* radio, uint32_t timestamp) {
        // ets_printf("TX Packet sent @ %lu\n", timestamp);
        Radio::clearFlags();

        // Remettre la radio en mode RX
        Radio::setRx();
        radio->setRadioState(iohcRadio::RadioState::RX);
        radio->unlockFHSS(iohcRadio::FHSSLockReason::TRANSMITTING);
    }
    /**
    * Sequential : Read queue — no concurrencies possible.
    * tickerCounter isn't called by the ISR.
    */
    void handle_interrupt_task(void *pvParameters) {
        iohcRadio *radio = static_cast<iohcRadio*>(pvParameters);
        RadioIrqEvent evt;
        // RF_IRQFLAGS1_0xDB -> MODEREADY RXREADY PLLLOCK RSSI PREAMBLEDETECT SYNCADDRESSMATCH
        // RF_IRQFLAGS2_0x26 -> FIFOLEVEL PAYLOADREADY CRCOK
        // RF_IRQFLAGS1_0xB0 -> MODEREADY TXREADY PLLLOCK
        // RF_IRQFLAGS2_0x48 -> FIFOEMPTY PACKETSENT

        while (true) {
            if (xQueueReceive(radioIrqQueue, &evt, portMAX_DELAY) == pdTRUE) {
                switch (evt.source) {
                    case 1: // DIO2 - Préambule
                        // radio->debugRadioFlags();
                        if (evt.edge == 1) { // Rising edge = préambule détecté
                            handlePreambleDetected(radio, evt.timestamp_us);
                        } else {
                            handlePreambleLost(radio, evt.timestamp_us);
                        }
                        break;

                    case 0: // DIO0 - Payload
                        // Lire IRQFLAGS2 pour déterminer la cause
                        uint8_t irqflags2 = Radio::readByte(REG_IRQFLAGS2);
                        if (irqflags2 & RF_IRQFLAGS2_PACKETSENT) {
                            // Événement de fin d'émission
                            handlePacketSent(radio, evt.timestamp_us);
                        } else if (irqflags2 & RF_IRQFLAGS2_PAYLOADREADY) {
                            // Événement de réception
                            handlePayloadReady(radio, evt.timestamp_us);
                        }
                        break;
                }
            }
        }
    }

    iohcRadio::iohcRadio() {
        Radio::initHardware();
        Radio::calibrate();

        Radio::initRegisters(MAX_FRAME_LEN);
        Radio::setCarrier(Radio::Carrier::Deviation, 19200);
        Radio::setCarrier(Radio::Carrier::Bitrate, 38400);
        Radio::setCarrier(Radio::Carrier::Bandwidth, 250);
        Radio::setCarrier(Radio::Carrier::Modulation, Radio::Modulation::FSK);

        // Configurer les interruptions avec pull-down pour éviter les faux déclenchements
        pinMode(RADIO_DIO0_PIN, INPUT); //_PULLDOWN);
        pinMode(RADIO_DIO2_PIN, INPUT); //_PULLDOWN);
        // Attacher les interruptions avec debounce matériel
        attachInterrupt(RADIO_DIO0_PIN, handle_interrupt_fromDIO0, RISING);
        attachInterrupt(RADIO_DIO2_PIN, handle_interrupt_fromDIO2, CHANGE);
        // #define GPIO_BIT_MASK  ((1ULL<<RADIO_DIO0_PIN) | (1ULL<<RADIO_DIO1) | (1ULL<<RADIO_DIO2_PIN))
        // gpio_install_isr_service(ESP_INTR_FLAG_IRAM);
        // gpio_config_t io_conf = {};
        // io_conf.intr_type = GPIO_INTR_POSEDGE;
        // io_conf.mode = GPIO_MODE_INPUT;
        // io_conf.pin_bit_mask = (1ULL<<RADIO_DIO0_PIN);
        // io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
        // io_conf.pull_up_en = GPIO_PULLUP_DISABLE;
        // gpio_config(&io_conf);
        // gpio_isr_handler_add(GPIO_NUM_26 , handle_interrupt_fromDIO0, nullptr);
        // // gpio_isr_handler_add(GPIO_NUM_35 , handle_interrupt_fromDIO1, nullptr);
        // io_conf.pin_bit_mask = (1ULL<<RADIO_DIO2_PIN);
        // io_conf.intr_type = GPIO_INTR_ANYEDGE;
        // gpio_config(&io_conf);
        // gpio_isr_handler_add(GPIO_NUM_34 , handle_interrupt_fromDIO2, nullptr);

        // start state machine
        ets_printf("Starting Interrupt Handler...\n");
        // Créer les mutex
        tx_mutex = xSemaphoreCreateMutex(); xSemaphoreGive(tx_mutex);
        // txQueue_mutex = xSemaphoreCreateMutex(); xSemaphoreGive(txQueue_mutex);
        txQueue_binary_sem = xSemaphoreCreateBinary(); xSemaphoreGive(txQueue_binary_sem); // Initialement libre
        fhss_state_mutex = xSemaphoreCreateMutex(); xSemaphoreGive(fhss_state_mutex);

        // Créer la queue ISR -> task
        radioIrqQueue = xQueueCreate(RADIO_IRQ_QUEUE_LEN, sizeof(RadioIrqEvent));
        // if (!radioIrqQueue) {
        //     ets_printf("ERROR: radioIrqQueue creation failed\n");
        // }


        // Créer la queue de paquets
        packetQueue = xQueueCreate(PACKET_QUEUE_SIZE, sizeof(iohcPacket));
        if (!packetQueue) {
            ets_printf("Failed to create packet queue\n");
        }

        lastPacketMutex = xSemaphoreCreateMutex();

        // Démarrer la task de traitement des paquets
        startPacketProcessor();

        BaseType_t task_code = xTaskCreatePinnedToCore(handle_interrupt_task,
            "handle_interrupt_task", 8192,
            this, 4,
             &handle_interrupt, xPortGetCoreID());
        if (task_code != pdPASS) {
            ets_printf("ERROR STATEMACHINE Can't create task %d\n", task_code);
            return;
        }
    }

    /**
     * @brief Returns a pointer to a single instance of the `iohcRadio`
     * class, creating it if it doesn't already exist.
     *
     * @return An instance of the `iohcRadio` class.
     */
    iohcRadio *iohcRadio::getInstance() {
        if (!_iohcRadio)
            _iohcRadio = new iohcRadio();
        return _iohcRadio;
    }
    /**
     * Initializes the radio with specified parameters and sets it to receive mode.
     */
    void iohcRadio::start(uint8_t num_freqs, uint32_t *scan_freqs, uint32_t scanTimeUs,
                          CallbackFunction rxCallback = nullptr, CallbackFunction txCallback = nullptr) {
        this->num_freqs = num_freqs;
        this->scan_freqs = scan_freqs;
        // this->scanTimeUs = scanTimeUs ? scanTimeUs : DEFAULT_SCAN_INTERVAL_US;
        this->rxCB = std::move(rxCallback);
        this->txCB = std::move(txCallback);
        this->currentFreqIdx = 0;
        this->expectingResponse = false;

