cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
        // CONFIGURATION PAR DÉFAUT
        if (scanTimeUs == 0) {
            // Démarrer en mode fast scan
            this->scanTimeUs = 30 * 1000; // 15ms par fréquence
            // ESP_LOGI("FHSS", "Using default adaptive FHSS: 15ms fast scan");
        } else {
            this->scanTimeUs = scanTimeUs;
        }

        Radio::clearBuffer();
        Radio::clearFlags();

        /* We always start at freq[0], the 1W/2W channel*/
        Radio::setCarrier(Radio::Carrier::Frequency, scan_freqs[0]); // CHANNEL2); // 868950000);

        if (this->num_freqs > 1) {
            this->currentFreqIdx = 0;

            // start adaptative
            adaptiveFHSS = new AdaptiveFHSS(this);

            // Start Frequency Hopping Timer
            adaptiveFHSS->switchToFastScan(adaptiveFHSS->fast_dwell);
            ets_printf("Starting FHSSTimer (%d) Handler...\n", adaptiveFHSS->fast_dwell);
        }
        Radio::setRx();
    }

    /**

    */

    void IRAM_ATTR iohcRadio::tickerCounter(iohcRadio *radio) {
        Radio::readBytes(REG_IRQFLAGS1, _flags, sizeof(_flags));
        uint32_t now = esp_timer_get_time();
        // Si sync détecté, c'est la fin du préambule
        if (_flags[0] & RF_IRQFLAGS1_SYNCADDRESSMATCH) {
        }
        if (radioState == RadioState::PREAMBLE) {

        } else if (radioState == RadioState::PAYLOAD) {
            radio->receive(false);
            Radio::clearFlags();
            radio->tickCounter = 0;
            if (!txMode) {
                radio->unlockFHSS(FHSSLockReason::RECEIVING); // ← Bonne raison!
            }
        }
    }

    /**

    */
    static TxPacketWrapper* IRAM_ATTR createPacketWrapper(iohcPacket* sourcePacket) {
        if (!sourcePacket) {
            return nullptr;
        }

        // Essayer d'allouer d'abord la copie du paquet
        iohcPacket* pktToSend = nullptr;

        pktToSend = new (std::nothrow) iohcPacket(*sourcePacket);
        if (!pktToSend) {
            // ets_printf("createPacketWrapper: Failed to allocate packet copy\n");
            return nullptr;  // Fuite zéro - rien n'a été alloué
        }

        // Ensuite allouer le wrapper
        auto wrapper = new (std::nothrow) TxPacketWrapper(pktToSend);
        if (!wrapper) {
            // ets_printf("createPacketWrapper: Failed to allocate wrapper\n");
            // Libérer le paquet
            delete pktToSend;
            return nullptr;  // Fuite zéro
        }

        return wrapper;
    }
    /**
 * Sends packets stored in a vector with a specified repeat time.
 *
 * @param TxPackets `Vector of pointers to `iohcPacket` objects.
*
 * Envoie un ou plusieurs paquets
 * Les paquets sont COPIÉS en interne, on garde la propriété des originaux
 */
    bool iohcRadio::send(std::vector<iohcPacket *> &TxPackets) {
        if (TxPackets.empty()) {
            return false;
        }
        if (xSemaphoreTake(txQueue_binary_sem, pdMS_TO_TICKS(100)) != pdTRUE) {
            return false;
        }

        txCounter = 0;
        size_t packetsAdded = 0;
        // Ajouter chaque paquet à la queue (en faisant une COPIE)
        for (auto *pkt: TxPackets) {
            if (pkt) {
                // Utiliser la factory
                if (TxPacketWrapper* wrapper = createPacketWrapper(pkt)) {
                    txQueue.push_back(wrapper);
                    //pkt = nullptr; // Transfer ownership
                    packetsAdded++;
                }
            }
        }
        TxPackets.clear();
        xSemaphoreGive(txQueue_binary_sem);

        if (packetsAdded == 0) {
            ets_printf("send(): no packets added");
            return false;
        }

        startTransmission();
        return true;

    }

    /**
     * Send a single packet, to help reveiced the answer in another frequency
     */
    bool iohcRadio::sendSingle(iohcPacket *packet) {
        if (!packet) return false;
        if (TxPacketWrapper* wrapper = createPacketWrapper(packet))
            txQueue.push_back(wrapper);
        else {
            return false;
        }
        startTransmission();
        return true;
    }

    /**
    * Insère un paquet en priorité (au début de la queue)
    * Pour les réponses urgentes
    */
    bool iohcRadio::sendPriority(iohcPacket *packet) {
        if (!packet) return false;
        // O(1)
        if (TxPacketWrapper* wrapper = createPacketWrapper(packet)) txQueue.push_front(wrapper);
        else {
            return false;
        }
        startTransmission();
        return true;
    }

    /**

    */
    void IRAM_ATTR iohcRadio::packetSender(iohcRadio *radio) {
        if (!radio || !radio->currentTxPacket) {
            ets_printf("packetSender called with null pointer\n");
            return;
        }

        digitalWrite(RX_LED, digitalRead(RX_LED) ^ 1);

        // Verrouiller pour transmission
        radio->lockFHSS(FHSSLockReason::TRANSMITTING);
        txMode = true;

        iohcPacket *pkt = radio->currentTxPacket->packet;

        // Use the frequency of the packet if specified. 1W is always set at CHANNEL2
        if (pkt->frequency == 0) pkt->frequency = radio->scan_freqs[radio->currentFreqIdx];;
        if (pkt->frequency != radio->scan_freqs[radio->currentFreqIdx]) {
            Radio::setCarrier(Radio::Carrier::Frequency, pkt->frequency);
        } else {
            pkt->frequency = radio->scan_freqs[radio->currentFreqIdx];
        }

        Radio::setStandby();
        Radio::clearFlags();
        // Not needed at start as already done at init
        // Radio::setPreambleLength(LONG_PREAMBLE_MS); //repeat?LONG_PREAMBLE_MS:SHORT_PREAMBLE_MS);
        Radio::writeBurst(REG_FIFO, pkt->payload.buffer, pkt->buffer_length);
        Radio::setTx();
        radio->setRadioState(iohcRadio::RadioState::TX);
        // There is no need to maintain radio locked between packets transmission unless clearly asked
        txMode = pkt->lock;

        packetStamp = esp_timer_get_time();

        pkt->decode(true);
        // Memorize last command sent
        IOHC::lastCmd = pkt->cmd();

        if (pkt->repeat > 0) {
            // Only the first frame is LPM (1W)
            pkt->payload.packet.header.CtrlByte2.asStruct.LPM = 0;
            pkt->repeat--;
        }
        if (pkt->repeat == 0) {
            radio->Ticker.detach();

