cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
            // spinlock au lieu de sémaphore
            uint32_t timeout = esp_timer_get_time() + 50000;  // 50ms en microsecondes
            while (radio->txQueue_busy && esp_timer_get_time() < timeout) {
                // Spinlock court - OK dans ISR
            }

            // Vérifier s'il y a un délai avant le prochain paquet
            bool hasNextPacket = false;
            uint32_t nextDelay = 0;

            // VÉRIFICATION RAPIDE sans modifier la queue
            if (!radio->txQueue_busy && !radio->txQueue.empty()) {
                hasNextPacket = true;
                nextDelay = radio->txQueue.front()->repeatTime;
            }

            if (hasNextPacket && nextDelay > 0) {
                // Délai avant le prochain paquet
                radio->Ticker.attach_ms(nextDelay, processNextPacketCallback, radio);
            } else if (hasNextPacket) {
                // Pas de délai, traiter immédiatement
                radio->processNextPacket();
            } else {
                // Plus de paquets à envoyer
                txMode = false;
                radio->unlockFHSS(FHSSLockReason::TRANSMITTING);
                radio->stopTransmission();
            }
        }

        digitalWrite(RX_LED, digitalRead(RX_LED) ^ 1);
    }

    /**

    */
    bool IRAM_ATTR iohcRadio::sent(iohcPacket *packet) {
        bool ret = false;
        if (txCB) ret = txCB(packet);
        return ret;
    }

    void iohcRadio::startPacketProcessor() {
    BaseType_t result = xTaskCreatePinnedToCore(
        packetProcessorTask,   // Function
        "PacketProcessor",     // Name
        4096,                  // Stack size
        this,                  // Parameter
        5,                     // Priority (au-dessus de la task IRQ)
        &packetProcessorTaskHandle,
        xPortGetCoreID()
    );

    if (result != pdPASS) {
        ets_printf("Failed to create packet processor task\n");
    }
}

void iohcRadio::packetProcessorTask(void* parameter) {

    iohcRadio* radio = static_cast<iohcRadio*>(parameter);
    iohcPacket receivedPacket;

    ets_printf("Packet processor task started\n");

    while (true) {
        // Attendre un paquet (bloquant)
        if (xQueueReceive(radio->packetQueue, &receivedPacket, portMAX_DELAY) == pdTRUE) {
            // **CRITIQUE: Vérifier que le FHSS est dans l'état approprié**
            if (radio->getFHSSState() != FHSSState::PROCESSING && radio->getFHSSState() != FHSSState::RECEIVING) {
                // BUG 08:10:36.472 > Packet received in wrong FHSS state: SCANNING
                ets_printf("Packet received in wrong FHSS state: %s\n", radio->fhssStateToString(radio->getFHSSState()));
                }

            // **VALIDATION SANS INTERRUPTION DU FLUX**
            bool shouldDecode = true;
            std::string rejectReason;

            // Critères de rejet (mais on maintient le flux)
            if (receivedPacket.buffer_length == 0) {
                shouldDecode = false;
                rejectReason = "Empty packet";
            }
            else if (receivedPacket.buffer_length < 9/*MIN_PACKET_LENGTH*/) {
                shouldDecode = false;
                rejectReason = "Too short";
            }

            if (shouldDecode)
                if (xSemaphoreTake(radio->lastPacketMutex, pdMS_TO_TICKS(10)) == pdTRUE) {
                    // Vérifier les doublons
                    if (receivedPacket == last1wPacket && receivedPacket.is1W()) {
                        rejectReason = "Duplicate";
                        shouldDecode = false;
                    } else {
                        // Sauvegarder le nouveau paquet
                        last1wPacket = receivedPacket;
                    }
                    xSemaphoreGive(radio->lastPacketMutex);
                }

            // Traiter le paquet
            // **TOUJOURS logger, même les rejets**
            if (!shouldDecode) {
                if (rejectReason != "Duplicate")
                ets_printf("Packet rejected: %s, len=%d\n",  rejectReason.c_str(), receivedPacket.buffer_length);
                radio->setFHSSState(FHSSState::SCANNING);
                radio->forceUnlockFHSS();
            } else {

            // Appeler le callback
                if (radio->rxCB) {
                    radio->rxCB(&receivedPacket);
                }

                // Décoder le paquet
                receivedPacket.decode(true);
            }
            // **MAINTENIR L'ÉTAT FHSS**
            // S'assurer que le FHSS n'est pas bloqué
            radio->setFHSSState(FHSSState::SCANNING);

        }
    }
}

    bool IRAM_ATTR iohcRadio::receive(bool stats = false) {

        digitalWrite(RX_LED, digitalRead(RX_LED) ^ 1);
        // **CRITIQUE: Toujours commencer par mettre à jour l'état FHSS**
        // adaptiveFHSS->onPacketActivity();
        setFHSSState(FHSSState::RECEIVING);

        // Utiliser un buffer TEMPORAIRE local
        tempRxPacket.reset();
        tempRxPacket.frequency = scan_freqs[currentFreqIdx];

        _g_payload_millis = esp_timer_get_time();
        packetStamp = _g_payload_millis;

        if (stats) {
            tempRxPacket.rssi = static_cast<float>(Radio::readByte(REG_RSSIVALUE)) / -2.0f;
            int16_t thres = Radio::readByte(REG_RSSITHRESH);
            tempRxPacket.snr = tempRxPacket.rssi > thres ? 0 : (thres - tempRxPacket.rssi);
            int16_t f = static_cast<uint16_t>(Radio::readByte(REG_AFCMSB));
            f = (f << 8) | static_cast<uint16_t>(Radio::readByte(REG_AFCLSB));
            tempRxPacket.afc = f * 61.0;
        }

        // Lire les données
        while (Radio::dataAvail()) {
            if (tempRxPacket.buffer_length < MAX_FRAME_LEN) {
                tempRxPacket.payload.buffer[tempRxPacket.buffer_length++] = Radio::readByte(REG_FIFO);
            } else {
                Radio::readByte(REG_FIFO);
            }
        }

        // **CRITIQUE: Toujours compléter le cycle FHSS même pour les paquets rejetés**
        // Marquer la fin de la réception pour le FHSS
        // **TOUJOURS envoyer à la queue, même les paquets "invalides"**
        // Les décisions de rejet se font dans le processor, pas ici
        // Envoyer une COPIE dans la queue (thread-safe)
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        BaseType_t queueResult = xQueueSendFromISR(packetQueue, &tempRxPacket, &xHigherPriorityTaskWoken);

        // DÉVERROUILLAGE IMMÉDIAT - le paquet est dans la queue
        // Ne pas attendre le traitement complet
        setFHSSState(FHSSState::PROCESSING);
        // Remettre en RX immédiatement
        Radio::setRx();
        setRadioState(RadioState::RX);

        // Déverrouiller le FHSS pour permettre le hopping
        unlockFHSS(FHSSLockReason::RECEIVING);
        adaptiveFHSS->update();

