cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
        if (xHigherPriorityTaskWoken) {
            portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
        }

        digitalWrite(RX_LED, false);
        return (queueResult == pdTRUE);
    }

    // HELPER : Détecter si un paquet est une réponse
    bool iohcRadio::isResponsePacket(iohcPacket *packet) {
        if (!packet) return false;

        return (packet->payload.packet.header.cmd == IOHC::lastCmd + 1);
    }

    /**
     * @deprecated Sets the value of `f_lock` based on the state of `_g_preamble`
     */
    // void IRAM_ATTR iohcRadio::i_preamble() {
    //     _g_preamble = digitalRead(RADIO_PREAMBLE_DETECTED);
    //     f_lock = _g_preamble;
    //     iohcRadio::setRadioState(_g_preamble ? iohcRadio::RadioState::PREAMBLE : iohcRadio::RadioState::RX);
    // }

    /**
     * @deprecated Reads the value of a digital pin and stores it in `_g_payload`
     */
    // void IRAM_ATTR iohcRadio::i_payload() {
    //     _g_payload = digitalRead(RADIO_PACKET_AVAIL);
    //     iohcRadio::setRadioState(_g_payload ? iohcRadio::RadioState::PAYLOAD : iohcRadio::RadioState::RX);
    // }


    void IRAM_ATTR iohcRadio::setRadioState(const RadioState newState) {
        radioState = newState;
    }

    /**
    * Callback statique pour le délai entre paquets
    */
    void IRAM_ATTR iohcRadio::processNextPacketCallback(iohcRadio *radio) {
        if (radio) {
            radio->processNextPacket();
        }
    }

    /**
    * Démarre la transmission si pas déjà en cours
    */
    void iohcRadio::startTransmission() {
        if (xSemaphoreTake(tx_mutex, pdMS_TO_TICKS(10)) != pdTRUE) {
            return;
        }

        if (!isSending) {
            isSending = true;
            xSemaphoreGive(tx_mutex);

            // Lancer le premier paquet
            processNextPacket();
        } else {
            xSemaphoreGive(tx_mutex);
        }
    }

    /**
     * Traite le prochain paquet de la queue
     */
    bool iohcRadio::processNextPacket() {
        // Nettoyer le paquet précédent
        if (currentTxPacket) {
            delete currentTxPacket;
            currentTxPacket = nullptr;
        }

        if (txQueue.empty()) {
            stopTransmission();
            return false;
        }

        currentTxPacket = txQueue.front();
        txQueue.pop_front();
        // Vérifier que le paquet est valide
        if (!currentTxPacket || !currentTxPacket->packet) {
            ets_printf("processNextPacket(): Invalid packet!\n");
            stopTransmission();
            return false;
        }

        // Lancer le timer pour ce paquet
        uint32_t repeatTime = currentTxPacket->repeatTime;
        if (repeatTime == 0) repeatTime = 100;  // Défaut si non spécifié

        // Lancer le timer pour ce paquet
        Ticker.attach_ms(repeatTime, packetSender, this);

        return true;
    }

    /**
     * Arrête la transmission
     */
    void iohcRadio::stopTransmission() {
        if (xSemaphoreTake(tx_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
            isSending = false;
            Ticker.detach();

            // Nettoyer le paquet courant
            if (currentTxPacket) {
                delete currentTxPacket;
                currentTxPacket = nullptr;
            }
            // Marquer comme non-envoi
            isSending = false;

            txMode = false;
            unlockFHSS(FHSSLockReason::TRANSMITTING);

            xSemaphoreGive(tx_mutex);
        }
    }

    /**
     * Vide la queue de transmission
     */
    void iohcRadio::clearTxQueue() {
        while (!txQueue.empty()) {
            const TxPacketWrapper *wrapper = txQueue.front();
            txQueue.pop_front();
            delete wrapper; // Le destructeur libère la mémoire
        }
    }

    /**
    * Vérifie si une transmission est en cours
    */
    bool iohcRadio::isTransmitting() const {
        bool transmitting = false;
        if (xSemaphoreTake(tx_mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
            transmitting = isSending;
            xSemaphoreGive(tx_mutex);
        }
        return transmitting;
    }

    /**
     * Annule toutes les transmissions en cours
     */
    void iohcRadio::cancelTransmissions() {
        Ticker.detach();
        clearTxQueue();
        stopTransmission();
    }
}
